       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE01.
       AUTHOR. MADAKA HERI.
       DATE-WRITTEN. 2025/09/19.
       DATE-COMPILED. 2024/09/19.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. MAC.
       OBJECT-COMPUTER. MAC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
         01 FILLER PIC X(10) VALUE "HELLO COBOL".
         01 FILLER PIC X(10) VALUE "MADAKA HERI".
       
       LINKAGE SECTION.
         01 LK-FILLER PIC X(20).

       PROCEDURE DIVISION.
           DISPLAY "HELLO COBOL".
           DISPLAY "MADAKA HERI".
           DISPLAY LK-FILLER.

           STOP RUN.

       END PROGRAM SAMPLE01.
